[{
    "title": "DAMN !",
    "id": "0",
    "previewImg": "articles/img/damn.jpeg",
    "img": "articles/img/Kendrick.jpg",
    "lastUpdated": "2 minutes ago",
    "preview": "Damn (stylized as DAMN.) is the fourth studio album by American rapper Kendrick Lamar. It was released on April 14, 2017, by Top Dawg Entertainment, Aftermath Entertainment and Interscope Records. The album features production from a variety of record producers, including executive producer from the Top Dawg Entertainment label-head Anthony 'Top Dawg' Tiffith, Sounwave, DJ Dahi, Mike Will Made It and Ricci Riera; as well as production contributions from James Blake, Steve Lacy, BadBadNotGood, Greg Kurstin, The Alchemist and 9th Wonder, among others.",
    "full": [
        "Damn (stylized as DAMN.) is the fourth studio album by American rapper Kendrick Lamar. It was released on April 14, 2017, by Top Dawg Entertainment, Aftermath Entertainment and Interscope Records. The album features production from a variety of record producers, including executive producer from the Top Dawg Entertainment label-head Anthony 'Top Dawg' Tiffith, Sounwave, DJ Dahi, Mike Will Made It and Ricci Riera; as well as production contributions from James Blake, Steve Lacy, BadBadNotGood, Greg Kurstin, The Alchemist and 9th Wonder, among others.",
        "Damn received widespread critical acclaim and debuted at number one on the Billboard 200, earning Lamar his third consecutive number one album in the United States. The album was supported by three singles: 'Humble', 'DNA' and 'Loyalty' featuring Rihanna. On May 20, 2017, Damn was certified Platinum by the Recording Industry Association of America (RIAA).",
        "'DNA' was the second song from the album to be recorded by Lamar and Mike Will, after 'Humble'. After the first verse was recorded with the beat that Mike Will had already prepared, Lamar started rapping the second verse a cappella, requesting that Mike Will build the beat around the rap. Lamar proposed that it sound like 'chaos', and Mike Will put together the second half of the song with the intention to make it 'sound like he's battling the beat.'",
        "The beat for 'Humble' was developed by Mike Will with the intention of recording with Gucci Mane, but later showed it to Lamar, thinking that this would be the first time Lamar had recorded with a trap-style beat that Mike Will had been known for. After recording, it was initially agreed upon that it would be released on Mike Will's debut album Ransom 2, but others convinced Lamar to keep it for his own next album.",
        "From Wikipedia, the free encyclopedia"
    ]
}, {
    "title": "Partynextdoor And Nardwuar Talk Life-Changing Albums & More",
    "id": "1",
    "previewImg": "articles/img/partyNextDoor.jpeg",
    "img": "articles/img/partyNextDoor.jpg",
    "lastUpdated": "2 hours ago",
    "preview": "Nardwuar, The Human Serviette may be know for his eccentric and cartoonish demeanor, but there's no denying that the man's interviews are insightful and often hilarious. Nardwuar recently met up with PARTYNEXTDOOR in Vancouver, where he blessed the singer with a Jodeci vinyl before discussing a variety of topics, including the life-changing nature of the Space Jam soundtrack. ",
    "full": [
        "Nardwuar, The Human Serviette may be know for his eccentric and cartoonish demeanor, but there's no denying that the man's interviews are insightful and often hilarious. Nardwuar recently met up with PARTYNEXTDOOR in Vancouver, where he blessed the singer with a Jodeci vinyl before discussing a variety of topics, including the life-changing nature of the Space Jam soundtrack. ",
        "'I know the whole entire cassette,' says PND, smiling. 'R. Kelly changed my life with that song.' He also goes on to discuss music, shouts out Toronto hip-hop (despite falsely attributing K-Os' 'Crabbuckit' to Saukretes), and why people should care about PND.",
        "check out the full interview below",
        "From Hot New Hip Hop"
    ],
    "youTube": "https://www.youtube.com/embed/J36pz7KEUSo"

}, {
    "title": "New Picture Of Travis Scott & Quavo In The Studio Surfaces",
    "id": "2",
    "previewImg": "articles/img/travis.jpeg",
    "img": "articles/img/travisScottQuavo.jpg",
    "lastUpdated": "7 hours ago",
    "preview": "Travis Scott and Quavo are hard at work on their collaboration project.",
    "full": [
        "Travis Scott and Quavo are hard at work on their collaboration project.",
        "Sharing a new studio picture of the two together on Instagram, Travis Scott has again ratcheted up the anticipation for the joint album from two of hip-hop's biggest names. No release date or tracklist has been made available as of this writing, but Travis Scott has been teasing this link-up for a long time, including during a freestyle at a concert.",
        "Hopefully the project is almost done and ready to be heard, because with that and Astroworld both supposedly coming from Travis before the end of the year, there's a legitimate chance that Scott could be leaving the music business soon. Fingers crossed that doesn't happen.",
        "From Hot New Hip Hop"
    ],
    "instagram": "https://www.instagram.com/p/BWYKMGjl1fg/"
}]
